[{"model": "core.autor", "pk": 1, "fields": {"nome": "J. K. Rowling"}}, {"model": "core.autor", "pk": 2, "fields": {"nome": "ana maria machado"}}, {"model": "core.autor", "pk": 3, "fields": {"nome": "Robert C. Martin"}}, {"model": "core.autor", "pk": 4, "fields": {"nome": "Arthur Conan Doyle"}}, {"model": "core.autor", "pk": 5, "fields": {"nome": "Machado de Assis"}}, {"model": "core.autor", "pk": 6, "fields": {"nome": "Aluísio Azevedo"}}, {"model": "core.livro", "pk": 1, "fields": {"titulo": "Harry Potter e a Pedra Filosofal", "sinopse": "Harry Potter é um garoto órfão que vive infeliz com seus tios, os Dursleys. Ele recebe uma carta contendo um convite para ingressar em Hogwarts, uma famosa escola especializada em formar jovens bruxos. Inicialmente, Harry é impedido de ler a carta por seu tio, mas logo recebe a visita de Hagrid, o guarda-caça de Hogwarts, que chega para levá-lo até a escola. Harry adentra um mundo mágico que jamais imaginara, vivendo diversas aventuras com seus novos amigos, Rony Weasley e Hermione Granger.", "autor": 1, "capa": "images/Harry-Potter-e-a-Pedra-Filosofal-livro.jpg"}}, {"model": "core.livro", "pk": 2, "fields": {"titulo": "Raul da Ferrugem Azul", "sinopse": "A obra Raul da ferrugem azul (1979), de Ana Maria Machado, narra a história de um menino que se chamava Raul e tenta descobrir o que são as estranhas manchas azuis que só ele consegue ver em seu corpo. Para isso ele programa uma viagem em busca de solucionar seu problema.", "autor": 2, "capa": "images/A1IB7yYNO5L.jpg"}}, {"model": "core.livro", "pk": 3, "fields": {"titulo": "Um Estudo em Vermelho: Sherlock Holmes", "sinopse": "Um estudo em vermelho é a primeira história de Sherlock Holmes e o primeiro livro publicado por Sir Arthur Conan Doyle (1859-1930). Muito menos do que um livro de estréia, esta história nasceu clássica, com seu ritmo vertiginoso de suspense e mistério que consagraria seu protagonista Sherlock Holmes como o mais apaixonante e popular detetive da história da literatura. Um estudo em vermelho propõe um enigma terrível e invencível para a polícia, que pede auxílio a Holmes: um homem é encontrado morto, sem ferimentos e cercado de manchas de sangue. Em seu rosto uma expressão de pavor. Um caso para Sherlock Holmes e suas fascinantes deduções narrado por seu amigo Dr. Watson, interlocutor sempre atento e não raro maravilhado com a inteligência e talento do detetive.", "autor": 4, "capa": "images/51pNmTP7BRL.jpg"}}, {"model": "core.livro", "pk": 4, "fields": {"titulo": "Código limpo: Habilidades práticas do Agile Software", "sinopse": "Clean Code, ou Código Limpo, é uma filosofia de desenvolvimento de softwares que consiste em aplicar técnicas simples que facilitam a escrita e a leitura de um código. Tornando-o, assim, de fácil compreensão.", "autor": 3, "capa": "images/41IRFCLk-kL.jpg"}}, {"model": "core.livro", "pk": 5, "fields": {"titulo": "Memórias póstumas de Brás Cubas", "sinopse": "Memórias Póstumas é uma narrativa confusa e sem linearidade. O personagem principal, como sugere o título, resolve, depois de morto, contar a história da sua vida através de uma seleção dos episódios mais relevantes, desde o seu nascimento até a sua morte. Essa narrativa não segue, porém, nenhuma sequência cronológica.", "autor": 5, "capa": "images/518-gbBB58S._SX312_BO1204203200_.jpg"}}, {"model": "core.livro", "pk": 6, "fields": {"titulo": "O cortiço", "sinopse": "Pobreza, corrupção, injustiça, traição são elementos integram O cortiço, principal obra do Naturalismo brasileiro. Nela, Aluísio Azevedo denuncia as mazelas sociais enfrentadas pelos moradores de um cortiço no Rio de Janeiro no século XIX. É um romance que convida a analisar por meio da observação crítica do cotidiano das personagens a animalização do ser humano, questão que se mostra, mais do que nunca, atual.", "autor": 6, "capa": "images/417OXQa1jwL._SX346_BO1204203200_.jpg"}}]